       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST-SQL-TYPES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AT.
       OBJECT-COMPUTER. IBM-AT.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

           01 BFLD  SQL TYPE IS BINARY(100).
           01 VBFLD SQL TYPE IS VARBINARY(100).

           01 CFLD  SQL TYPE IS CHAR(100).

           01 VCFLD PIC X(100) VARYING.

           01 DATASRC PIC X(64).
           01 DBUSR   PIC X(64).

       EXEC SQL
            INCLUDE SQLCA
       END-EXEC.

       PROCEDURE DIVISION.

       000-CONNECT.
           DISPLAY "DATASRC" UPON ENVIRONMENT-NAME.
           ACCEPT DATASRC FROM ENVIRONMENT-VALUE.
           DISPLAY "DATASRC_USR" UPON ENVIRONMENT-NAME.
           ACCEPT DBUSR FROM ENVIRONMENT-VALUE.

           EXEC SQL
              CONNECT TO :DATASRC USER :DBUSR
           END-EXEC.

           IF SQLCODE NOT = 0 THEN
              DISPLAY 'CONNECT FAILED: ' SQLCODE
              GO TO 999-EXIT
           END-IF.

       100-MAIN.
           DISPLAY 'SQL TYPES TEST'.

           EXEC SQL CONNECT RESET END-EXEC.

       999-EXIT.
           STOP RUN.
