       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST-BASIC-SELECT.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AT.
       OBJECT-COMPUTER. IBM-AT.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

           01 DATASRC PIC X(64).
           01 DBUSR   PIC X(64).
           01 DBPWD   PIC X(64).

           01 T1      PIC 9(3) VALUE 0.

       EXEC SQL
            INCLUDE SQLCA
       END-EXEC.

       PROCEDURE DIVISION.

       000-CONNECT.
           DISPLAY "DATASRC" UPON ENVIRONMENT-NAME.
           ACCEPT DATASRC FROM ENVIRONMENT-VALUE.
           DISPLAY "DATASRC_USR" UPON ENVIRONMENT-NAME.
           ACCEPT DBUSR FROM ENVIRONMENT-VALUE.
           DISPLAY "DATASRC_PWD" UPON ENVIRONMENT-NAME.
           ACCEPT DBPWD FROM ENVIRONMENT-VALUE.

           EXEC SQL
              CONNECT TO :DATASRC USER :DBUSR USING :DBPWD
           END-EXEC.

           IF SQLCODE NOT = 0 THEN
              DISPLAY 'CONNECT FAILED: ' SQLCODE
              GO TO 999-EXIT
           END-IF.

       100-MAIN.
           EXEC SQL
               SELECT COUNT(*) INTO :T1 FROM EMPTABLE
           END-EXEC.

           DISPLAY 'SELECT SQLCODE: ' SQLCODE.
           DISPLAY 'COUNT RESULT : ' T1.

           EXEC SQL CONNECT RESET END-EXEC.

       999-EXIT.
           STOP RUN.
